Revit 2027 API
ParameterTypeId.RbsPipeConnectiontypeParam Property
 "Connection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeConnectiontypeParam { get; }
Public Shared ReadOnly Property RbsPipeConnectiontypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeConnectiontypeParam {
	ForgeTypeId^ get ();
}
static member RbsPipeConnectiontypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace